[
    "What's an unexpected skill you have or something surprising about you?",
    "If you could invent anything, what would it be and why?",
    "Describe your dream vacation. Where would you go and what would you do?",
    "What's one risk you're glad you took and why?",
    "Share a book or movie that profoundly impacted you.",
    "What's a favorite childhood memory of yours?",
    "What's the best advice you've ever received?",
    "If you could have any superpower, what would it be and why?",
    "Tell us about a dish you love to cook and the story behind it.",
    "Describe a moment when you felt truly proud of yourself.",
    "What's the most meaningful gift you've ever given or received?",
    "What's something you're passionate about and how did that passion develop?",
    "If you could change one thing about the world, what would it be and why?",
    "Tell us about a challenge you've overcome and how it changed you.",
    "What's a song that always lifts your mood?",
    "What's something you've always wanted to learn?",
    "Share a favorite family tradition.",
    "What's one thing you'd like to achieve in the next five years?",
    "If you could have dinner with any historical figure, who would it be and why?",
    "What's an accomplishment you're really proud of?",
    "What's a place that holds special meaning for you and why?",
    "Tell us about a time when a stranger made your day.",
    "What's a habit or routine that you rely on daily?",
    "What's your favorite way to give back to your community or to a cause you care about?",
    "Share a funny or embarrassing story from your life.",
    "Describe an experience that changed your perspective on life.",
    "If you could invite three people, dead or alive, to a dinner party, who would they be and why?",
    "What's the most adventurous thing you've ever done?",
    "What book or movie had a big impact on you and why?",
    "What's your favorite way to spend a rainy day?",
    "Tell us about a cause that's close to your heart.",
    "What's one of your most cherished childhood memories?",
    "Describe a time when you stepped out of your comfort zone.",
    "What's something you've always wanted to learn, and why?",
    "Tell us about the best vacation you ever took.",
    "What's your go-to recipe when cooking for someone special?",
    "Share a song that always makes you dance and why you love it.",
    "What's a favorite family tradition of yours?",
    "If you could be any animal for a day, which one would you be and why?",
    "What's a skill or hobby you've picked up recently?",
    "Tell us about a time when you made a positive impact on someone's life.",
    "What's your idea of a perfect date?",
    "What's the most beautiful place you've ever seen?",
    "Share a goal you're currently working towards.",
    "What's a quote that inspires you and why?",
    "Tell us about a teacher or mentor who influenced you.",
    "What's something you're afraid of that might surprise people?",
    "What's a favorite piece of art (painting, sculpture, music, movie, literature) and why does it move you?",
    "Share a small act of kindness you'll never forget.",
    "What's something you'd love to invent?"
  ]
  